Revit 2024 API
ConnectionValidationWarning.GetParts Method
 Get ElementIds of affected parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ISet<ElementId> GetParts()
Visual Basic
Public Function GetParts As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetParts()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace